In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# Create an empty dataset
df = pd.DataFrame()

# Create two variables called x0 and x1. Make the first value of x1 a missing value
df['x0'] = [0.3051,0.4949,0.6974,0.3769,0.2231,0.341,0.4436,0.5897,0.6308,0.5]
df['x1'] = [np.nan,0.2654,0.2615,0.5846,0.4615,0.8308,0.4962,0.3269,0.5346,0.6731]

# View the dataset
df

       x0      x1
0  0.3051     NaN
1  0.4949  0.2654
2  0.6974  0.2615
3  0.3769  0.5846
4  0.2231  0.4615
5  0.3410  0.8308
6  0.4436  0.4962
7  0.5897  0.3269
8  0.6308  0.5346
9  0.5000  0.6731

In [ ]:
df.fillna(df.mean())

       x0        x1
0  0.3051  0.492733
1  0.4949  0.265400
2  0.6974  0.261500
3  0.3769  0.584600
4  0.2231  0.461500
5  0.3410  0.830800
6  0.4436  0.496200
7  0.5897  0.326900
8  0.6308  0.534600
9  0.5000  0.673100

In [ ]:
df.fillna(df['x0'].mean())

       x0       x1
0  0.3051  0.46025
1  0.4949  0.26540
2  0.6974  0.26150
3  0.3769  0.58460
4  0.2231  0.46150
5  0.3410  0.83080
6  0.4436  0.49620
7  0.5897  0.32690
8  0.6308  0.53460
9  0.5000  0.67310

In [ ]:
df.loc[:, ['x0']].fillna(df['x0'].mean(), inplace=True) #selecionar as colunas onde se deve aplicar o fillna

In [ ]:
df.loc[:, ['x1']].fillna(df['x1'].mean(), inplace=True) #selecionar as colunas onde se deve aplicar o fillna

In [ ]:
# Quando X1 for menor que 10, substitui os elementos do df['X1']<10 pela média
df.loc[df['x1']<10, ['x1']].fillna(df[df['x1']<10].mean(), inplace=True)